{
    "architectures": [
      "HybridLLMForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "block_hidden_size": 2048,
    "initializer_range": 0.02,
    "pre_intermediate_size": 3584,
    "post_intermediate_size": 3584,
    "max_position_embeddings": 32768,
    "model_type": "hybrid_llm",
    "num_attention_heads": 32,
    "num_pre_hidden_layers": 8,
    "num_post_hidden_layers": 8,
    "expansion_factor": 16,
    "cache_head_dim": 16,
    "hybrid_block_configs" : [
      {"block_size":8, "intermediate_size": 7168, "num_layers": 8}
    ],
    "num_key_value_heads": 16,
    "rms_norm_eps": 1e-05,
    "rope_theta": 1000000.0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.42.0.dev0",
    "use_cache": true,
    "vocab_size": 32768
  }
  