{
    "architectures": [
      "DualMistralForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act_small": "silu",
    "hidden_act_large": "silu",
    "hidden_size_small": 2048,
    "hidden_size_large": 2048,
    "initializer_range": 0.02,
    "intermediate_size_small": 5632,
    "intermediate_size_large": 5632,
    "max_position_embeddings": 32768,
    "model_type": "dual_mistral",
    "num_attention_heads_small": 32,
    "num_attention_heads_large": 32,
    "num_cross_attention_heads_small": 32,
    "num_hidden_layers_small": 4,
    "num_hidden_layers_large": 22,
    "num_key_value_heads_small": 4,
    "num_key_value_heads_large": 4,
    "rms_norm_eps": 1e-05,
    "rope_theta": 1000000.0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.42.0.dev0",
    "use_cache": true,
    "vocab_size": 32768
  }